Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 第581章 英雄救美
en_us: Chapter 581: Hero Rescues a Beauty

source: 第583章 偷袭者
en_us: Chapter 583: Ambusher

source: 第584章 猿粪
en_us: Chapter 584 Ape Shit (猿粪)

source: 第585章白衣女人
en_us: Chapter 585: Woman in White

source: 第587章 幻阵
en_us: Chapter 587: Illusion Array

source: 第588章 水下世界
en_us: Chapter 588 Underwater world

source: 第589章 合作
en_us: Chapter 589: Collaboration

source: 第591章 结界破除
en_us: Chapter 591: Barrier Broken

source: 第592章 独立空间
en_us: Chapter 592 An independent dimension (独立空间)

source: 第593章 被困
en_us: Chapter 593: Trapped

source: 第595章 无名小岛
en_us: Chapter 595: Uncharted Island

source: 第596章 抹掉灵智
en_us: Chapter 596 Removing it's intelligence (抹掉灵智)

source: 第597章 黄鼠兽
en_us: Chapter 597: Ground Squirrel Beast (黄鼠兽)

source: 第599章 利用价值
en_us: Chapter 599: Use Value

source: 第600章‘真相’
en_us: Chapter 600 The 'Truth'

source: 第601章 离开
en_us: Chapter 601: Departure

source: 第603章 桃源遗迹
en_us: Chapter 603: The Ruins of the Peach Blossom Spring

source: 第604章 灵山八府
en_us: Chapter 604 Eight mansions of the Spirit Mountain (灵山八府)

source: 第605章 水妖再现
en_us: Chapter 605: Goodbye Water Demon

source: 第607章 完成心愿
en_us: Chapter 607: Wish Fulfilled

source: 第608章 心意不通
en_us: Chapter 608 The feelings that didn't get through (心意不通)

source: 第609章 血影
en_us: Chapter 609: Blood Figure

source: 第611章 那道坎
en_us: Chapter 611: That Road

source: 第612章 炼丹
en_us: Chapter 612 Refining Pills

source: 第613章 突兀的男人
en_us: Chapter 613: Unexpected Man

source: 第474章 得手
en_us: Chapter 474: Objective Achieved Translated by Kollumceti of Exiled Rebels Scanlations

source: 第478章 连心蛊
en_us: Chapter 478: Heart Linking Gu Translated by Kollumceti of Exiled Rebels Scanlations

source: 第490章 找到了
en_us: Chapter 490: I've Found You! Translated by Kollumceti of Exiled Rebels Scanlations

source: 第494章 猪一样的队友
en_us: Chapter 494: A Pig-Like Teammate Translated by Kollumceti of Exiled Rebels Scanlations

source: 第498章 花姑
en_us: Chapter 498: Hua Gu Translated by Kollumceti of Exiled Rebels Scanlations

source: 第502章 说来话长
en_us: Chapter 502: It's a Long Story Translated by Kollumceti of Exiled Rebels Scanlations

source: 第506章 惊喜之物
en_us: Chapter 506: A Pleasant Surprise Translated by Kollumceti of Exiled Rebels Scanlations

source: 第510章 骗子与贼
en_us: Chapter 510: Swindlers and Thieves Translated by Kollumceti of Exiled Rebels Scanlations

source: 第514章 发现身份
en_us: Chapter 514: Identity Discovered Translated by Kollumceti of Exiled Rebels Scanlations

source: 第518章 鬼哭涯天狗
en_us: Chapter 518: The Weeping Ghost Shore's Tiangou Translated by Kollumceti of Exiled Rebels Scanlations

source: 第522章 迁入骷髅峰
en_us: Chapter 522: Venturing Into The Human Skull Peak Translated by Kollumceti of Exiled Rebels Scanlations

source: 第530章 酒楼老板娘
en_us: Chapter 530: The Proprietress of the Restaurant (酒楼) Translated by Kollumceti of Exiled Rebels Scanlations

source: 第534章 老人与出海
en_us: Chapter 534: The Old Man and Going Out to Sea Translated by Kollumceti of Exiled Rebels Scanlations

source: 第538章 玄龟族来人
en_us: Chapter 538: The Black Turtle Clan Arrives (玄龟族来人) Translated by Kollumceti of Exiled Rebels Scanlations

source: 第542章 ‘小偷’
en_us: Chapter 542: 'Thief' Translated by Kollumceti of Exiled Rebels Scanlations

source: 第554章 放风筝
en_us: Chapter 554: Kite Flying Translated by Kollumceti of Exiled Rebels Scanlations

source: 第558章 哄抬价格
en_us: Chapter 558: Artificially Inflating the Price Translated by Kollumceti of Exiled Rebels Scanlations

source: 第562章 迟钝的光团
en_us: Chapter 562: The Sluggish Ball of Light Translated by Kollumceti of Exiled Rebels Scanlations

source: 第566章 转生丹
en_us: Chapter 556: The Reincarnation Pill Translated by Kollumceti of Exiled Rebels Scanlations

source: 第570章 山洞落户
en_us: Chapter 570: Setting up Home in a Cave Translated by Kollumceti of Exiled Rebels Scanlations

source: 第574章 大陆第一天才
en_us: Chapter 574: The Continent's Number One Genius Translated by Kollumceti of Exiled Rebels Scanlations

source: 第578章 长歪的混球
en_us: Chapter 578: HunQiu Who Had Grown Up Crooked (长歪的混球) Translated by Kollumceti of Exiled Rebels Scanlations

source: 第582章 没心报
en_us: Chapter 582: Nothing Goes Unpunished (没好报) Translated by Kollumceti of Exiled Rebels Scanlations

source: 第586章 背黑锅
en_us: Chapter 586: Made Into A Scapegoat Translated by Kollumceti of Exiled Rebels Scanlations

source: 第590章 已死
en_us: Chapter 590: Dead (已死) Translated by Kollumceti of Exiled Rebels Scanlations

source: 第594章 轻敌
en_us: Chapter 594: Underestimating the Enemy Translated by Kollumceti of Exiled Rebels Scanlations

source: 第598章 上门
en_us: Chapter 598: Visit Translated by Kollumceti of Exiled Rebels Scanlations

source: 第602章 刮目相看
en_us: Chapter 602: Look Upon One In A Different Light Translated by Kollumceti of Exiled Rebels Scanlations

source: 第606章 死里逃生
en_us: Chapter 606: Barely Escaped From Death Translated by Kollumceti of Exiled Rebels Scanlations

source: 第610章 约定
en_us: Chapter 610: Promise Translated by Kollumceti of Exiled Rebels Scanlations

source: 第614章 身份猜测
en_us: Chapter 614: Identity guessing Translated by Kollumceti of Exiled Rebels Scanlations

source: 第一件拍卖物品是一个炉鼎，名为红鹰炉，外表像展翅的红鹰，故此得名，虽然红鹰炉在鼎榜上的排名只排了第九十九名，十分靠后，但是抢夺的人依然不少。
en_us: The first item was a cauldron known as the Red Eagle Cauldron (红鹰炉). It's shaped like a red eagle taking flight, hence the name. Although it was only ranked ninety-nine, towards the bottom, there was still a lot of people fighting over it.

source: 第一排的座位几乎已经有九成坐满了人，走下去就看到一张张曾经在苍盟见过的熟悉脸孔。
en_us: The first row was almost full. Walking down, he could see those familiar faces he had seen in the Cang Alliance.

source: 第一排虽然说是给各大势力，但是真正坐在第一排的只有游震天等实力强大的圣境强者和十神榜的强者，而他们家族的人则坐在他身后，其他势力也一样。
en_us: Though the first row was given to the powerful Factions, the ones who actually were allowed to sit there were You ZhenTian and the other Sacred Level powerhouses, as well as the ones on the Ten God rankings. As for their clansmen, they took up the seats behind these people. It was the same for the other factions.

source: 第一排还有几个位置，凌霄拉着游小默过去直接占了两个位置。
en_us: There were still a few seats in the first row. Ling Xiao pulled You XiaoMo over and took two.

source: 第一次从上面飞过的时候只是觉得很恐怖，但还不至于让他脚软，果然亲身体验过才知道妖坟场的恐怖。
en_us: The first time he had flown across, he had felt that it was very scary, but still not scary enough to make his knees weak. However, it seemed that one could only know the true terror of the Demon Beast Graveyard by experiencing it firsthand.

source: 第一次遇到这种情况，程荷也为难起来，她请来中庭交易会最好的鉴定师出来，在对方检验过后，得出的结果却是差不多，这下子就难办了。
en_us: It was her first time encountering this situation and Cheng He felt awkward. She invited the best appraisal master at the Courtyard Trade Fair over and after the other party's assessment, the result was that the quality of the pills were nearly the same. This would be hard to deal with now.

source: 第九层没有第八层大，囚牢也只有十个，其中五个有人，这些人的实力两个是神境，其余三人是地境，囚牢就想五星级酒楼一样豪华，不过囚住要他们的牢笼却是世界上最坚硬的铁块铸成的。
en_us: The ninth floor wasn't as large as the eights, and there were only ten prison cells, with five prisoners in total. Two of the prisoners wer Divine level, and the other three were Earth level. The prisons were as extravagant as a five star hotel, but the bars were made from the strongest kind of steel in this world.

source: 第二个好处则是巩固以及守护经脉，就像在脆弱的玻璃外面加上一层钢铁一样，使身体的经脉在服用一些能量比较狂暴的东西时不会受到冲击。
en_us: Its second benefit was that it could strengthen and protect the meridians, just like adding a layer of steel on top of fragile glass. It ensured that when some explosive energy was used in the meridians, they wouldn't receive a blow.

source: 第二件压轴物只是一本顶级功法。
en_us: The second item was a pinnacle level soul training manual.

source: 第二天一大早，附近的人起床后发现好来客栈被一把火烧光了，而他们竟然一个都没有发现，除了失踪的掌柜四人，当天住在客栈的客人都被扔在街上，他们一点伤也没有。
en_us: On the following morning, the neighbors woke up to find that HaoLai Inn had been burned to the ground and none of them had noticed. Apart from the missing owner and employees, the customers at HaoLai Inn had all been thrown onto the streets, unharmed.

source: 第二天一早，两人便出发了。
en_us: The following morning, the two set out.

source: 第二天下午，房间的桌上就多了一张纸条。
en_us: On the afternoon of the second day, there was a note left on the table of the room.

source: 第二天天亮，凌霄仍然在床上调养。
en_us: At the morning of the second day, Ling Xiao was still recuperating on the bed.

source: 第二天早上，他给自己做了锅肉粥，因为做多了，万厨师和助手终于如愿以偿吃上他做的东西。
en_us: On the second morning, he made himself a meat congee, and because he made too much, Chef Wan and his assistant finally got what they wished for, his food.

source: 第二天早上，游小默就准备开始炼丹了。
en_us: On the morning of the second day, You XiaoMo got ready to refine the pill.

source: 第二天，后院堆积如山的尸体差点把酒楼的伙计吓死，知道第三天晚上终于消停了。
en_us: The second day, the mountain-like pile of corpses in the backyard almost scared the inn's manager to death, and it only finally stopped on the third night.

source: 第二天，昨晚发生的事情在白骨小镇传得沸沸扬扬，大家在讨论两人这一次为何会跑到白骨小镇来，不过也有一些细心的人发现端倪。
en_us: On the second day, rumors and gossips of what happened last time at the White Bone Town were everywhere. Everyone was discussing as to why they had returned, but some, more observant one, found inklings of the situation.

source: 第二天，玄龟族果然来人了，他们是直接找到客栈来的，一共有三人，其中一个恰巧是游小默和凌霄认识的，正是玄明。
en_us: On the second day, the people from the Black Turtle Clan indeed came. They came directly after finding the inn, and there was a total of three people. One of these people was someone You XiaoMo and Ling Xiao knew, for better or worse: Xuan Ming.

source: 第二天，这家客栈可是说的黑眼圈最严重的人，很多人都对谢俊他们很不满，但碍于谢俊的实力，他们都是敢怒不敢言。
en_us: The second day, the people of this inn were said to have the heaviest eyebags, so many people were very displeased with Xie Jun. But taking into consideration Xie Jun's strength, they didn't dare to say anything, and they could only get angry.

source: 第二次来，凌霄也是提前通知对方。
en_us: Ling Xiao had also notified the other party in advance the second time he came.

source: 第二轮比赛名为重力屋测试。
en_us: The second round was called the Gravity Room.

source: 第二道荤菜他打算做麻仁酥鸭，这道菜相对来说比较美观，而且它既鲜嫩又酥脆，口感是一流的。
en_us: The second meat dish he was making was Sesame Duck(麻仁酥鸭), in comparision, it was more visually appealing. Not only was it crispy but also tender, the texture was top notch.

source: 第五件拍卖品有些出乎大家的意料，因为那是一瓶酒。
en_us: The fifth item was a bit surprising as it was a bottle of wine.

source: 第六府也就是三大凶门中的死门，死亡率非常高。
en_us: The sixth mansion was also the 'death door', part of the 'three bad luck doors' (三大凶门), with a high mortality rate.

source: 第四个则在卫白生辰上有过一面之缘的姬凤，相较于姬云琅三人一脸傲慢轻视，他本人则老神在在的站在最后面，带笑的眼睛完全就是看戏的表情。
en_us: The last one was Ji Feng, whom he had meant once on Wei Bai’s birthday. Compared with the other three’s arrogant expressions, he stood at the back, calm and collected. His eyes were smiling, as if waiting for a good show to unfold.

source: 等两艘船的货物都装上去，已经过了酉时。
en_us: It was already past seven o'clock in the evening (酉时) when cargo for the two merchant ships were loaded up.

source: 等他们反应过来，远处突然传来一道令人心悸的杀机。
en_us: By the time they did, a sliver of terrifying killing intent shot over from afar.

source: 等他们穿过那层明显与其他地方的颜色还要深的黑雾，一阵阴风突然从脸颊刮过，游小默冷不丁打了个寒颤。
en_us: When they went through the layer of black fog that was clearly darker than the rest of the mist, a gust of dark wind suddenly scraped past their cheeks. You XiaoMo couldn't help but shiver.

source: 等他们赶到的时候，银戈和展雨轩正围着风迟云发愁。
en_us: Yin Ge and Zhan Yu Xuan were surrounding Feng ChiYun while fretting when they arrived.

source: 等他们赶过去，第六府外面的结界果然消失了，再怎么厉害的结界，毕竟经过千万年，在强者们合力攻击下还是破了。
en_us: Once they hurried over, the barrier to the sixth mansion unmistakably disappeared. No matter how strong it was, after tens of millions of years, it was going to broken under the combined strength of experts.

source: 等他做完这一切，太阳已经下山了。
en_us: The sun had already set by the time he was finished with everything.

source: 等他到了安全的地方，少不了揍他一顿。
en_us: By the time he reached a safe spot, he wanted to give him a round beating.

source: 等他回玄龟族，要不了多久就会把你忘了。”凌霄听着他的话便不以为意的说道。
en_us: When he returns to the Black Turtle Clan, he'll forget you before very long." Ling Xiao said dismissively after he heard what You XiaoMo was saying.

source: 等他想再找的时候，茫茫人海，对方板有可能已经不在通天大陆，他要去哪里找？
en_us: There was a vast sea of people to comb through when he wanted to find You XiaoMo's father again.,In addition, the other party may have long left the TongTian Continent. From where should be even begin to look?

source: 等他抬头，就看到凌霄的脸竟然恢复了真容，而且变得红通通一片，隐隐还透着一丝扭曲，猛地推开游小默，盘起腿原地坐下，一句话也不说就闭起眼睛。
en_us: When he raised his head, he saw that Ling Xiao's face had returned to its true form and a flush had spread across the other's cheeks, expression twisting a little. He hurriedly pushed You XiaoMo aside, crossing his legs as he sat down. He closed his eyes, not saying a word.

source: 等他提炼完所有灵草，天已经亮了。
en_us: Once he finished refining all of the magic herbs, the sky was already light.

source: 等他脱险后，他一定向凌霄忏悔。
en_us: After he got out of this, he would beg for Ling Xiao's forgiveness.

source: 等凌霄和游小默出来后，十层的出入口已经被堵得水泄不通，八九层的守卫者几乎都聚集在这里了，为首的是游单两兄弟。
en_us: After Ling Xiao and You XiaoMo came out, they found that the entrance to the tenth floor had been completely blocked off. It seemed that all the guards of the eighth and ninth floors had gathered here with You Dan and his brother at the front.

source: 等宴会结束后，他们想查出是谁带走风迟云也不大可能，因为中途离开会场的人并不少，一些急着赶路的人也是在中途就离开绵绵山的，赤血家族要追究起来并不容易，而且风迟云的情况也不能暴露出去。
en_us: Even if they wanted to find out who had brought Feng ChiYun away when the banquet was over, it was impossible. There were many who had left the banquet midway and a few people who had to hurry on their journey also left the continuous mountain in the middle of the banquet. It was not easy for the Vermilion Blood Clan to investigate all of them. Furthermore, they could not disclose Feng ChiYun's circumstances.

source: 等黄鼠兽走后，游小默幽怨的瞪了凌霄一眼，“你是不是早就知道了？”
en_us: Once the Ground Squirrel Beast left, You XiaoMo turned to stare at Ling Xiao bitterly, "You already knew, didn't you?"

source: 答案是肯定的。
en_us: The answer is yes.

source: 简而言之，酒师的作用比较单调，若只是为了恢复灵力，很多人大概更愿意服食灵丹。
en_us: Basically, the use of a sommelier was straightforward, to speed the recover of soul power. But, if it was just that, then most people would probably prefer to eat magic pills instead.

source: 算盘倒是打得满满的。
en_us: He sure planned it nicely. (???)(算盘倒是打得满满的)

source: 算盘打得满满的，岂料在刑七过来的途中，南面就爆发了混乱，有人将城门炸开，引起人群暴动，刑七直觉这件事和莫景脱不开关系。
en_us: The plan seemed good in their heads (算盘打得), but as Xing Qi was on his way, the West side exploded into chaos. Someone had bombed the gates open, creating a riot. Xing Qi's intution said that this must have something to do with Mo Jing.

source: 管理据点的人是傅苍穹的四徒弟叶农，叶农知道游小默与他师傅的交易，上次也是他接待游小默的，不过对于他们的到来还是略感诧异。
en_us: The one in charge was Fu CangQiong's fourth disciple Ye Nong. He knew of their deal with his Shifu and last time it was him to greeted them too, but even so, he was still surprised at their arrival.

source: 糙汉轻蔑的冷笑一声。
en_us: The burly man sneered in disdain.

source: 紧张的时刻一波接一波，大家却没有松懈，因为终于轮到最后一件压轴物品，也就是游小默在邀请贴上看到的远古之物，具体并没有说明。
en_us: The tense moments came one after another, yet everybody did not slack off because it was finally time to bid for the last item. This was also the ancient object that You XiaoMo saw on the invitation, but the specific details on the item was not explained.

source: 紧接着有几个人跑了进来，有人立刻认出带头走进来的人，他就是游青云的弟弟游青山，游青山看到游震天，立刻喊了一声‘爷爷’。
en_us: Then, several people ran inside. Some people immediately recognized the one in the lead. He was You QingYun's younger brother, You QingShan. When You QingShan saw You ZhenTian, he immediately called out, "Grandfather!"

source: 紧随其后是赤血家族的子弟，其中就有在六月山脉与游小默见过面的游青山，还有一些他不认识的人，不过让游小默比较在意的是，赤血家族的人似乎对走在游青山身边的男子很恭敬。
en_us: Following closely behind were the younger generations of the Vermillion Blood Clan. Included among them was You QingShan who You XiaoMo had met in the June Mountains, and there were also some who he did not recognise. However, what You XiaoMo was more concerned about was that the Vermillion Blood Clan members seemed to be very deferential to the man walking beside You QingShan.

source: 红冠鸡个头大，肉质比火鸡坚韧，用火烤不易熟，所以需要的时间比火鸡多了一倍不止。
en_us: Red-Crowned Turkey was huge and it's meat was tougher than a normal turkey, so it wasn't easily cooked over flame, at least doubled the time of a normal turkey.

source: 红冠鸡个头比较大，处理起来比火鸡麻烦一点，不过胜在分量足，一只顶三只火鸡，要知道自从饭桌加入了吞金兽和良知金翅虫，他们也爱上叫花鸡，每次他要做两三只叫花鸡才够他们吃。
en_us: The Red-Crowned Turkey was bigger than a normal turkey, so it was harder to deal with, but it was filling, as much as three normal turkeys. Ever since his beasts joined their dinner table, they fell in love with the dish, the Beggar's Chicken (叫花鸡). He had to make two or three each time for them to eat.

source: 红卡在乙级学区或许没有太大的作用，但那是因为一些需要红卡才能进入的地方都在甲级学区，可是游小默还没去甲级学区就拥有一张红卡。
en_us: The red card didn’t have much use in Ward B, but that was because the places that could only be accessed by a red card were all in Ward A. Yet You XiaoMo hadn’t even gotten into Ward A yet and he already had one.

source: 红色的玉简，此刻就像一块普通玉简摊在凌霄手里，只要拿起来看一看，立刻就能知道这块被埋藏了万年以上的玉简里到底记录着什么东西。
en_us: At this moment, the red colored jade drive in Ling Xiao's hands appeared just like an ordinary jade drive. As long as he picked it up and took a look, You XiaoMo would immediately know what was recorded in the jade drive that had been buried for more than ten thousand years.

source: 约他们过来见面的人似乎是一老一少，两人身上都穿着青色道袍，束起的头发只用一根绿色的簪子点缀。
en_us: The person who asked to meet them seemed to be an old and a young man. Both were wearing cyan daopaos (青色道袍) and their hair was tied up and adorned with a green hair pin.

source: 纱帐后的男人将酒杯扔到地上，酒水洒在昂贵的绒毯上，两名侍女头垂得更低了。
en_us: The man behind the curtain tossed the cup onto the floor, wine splashing across expensive carpets. The two handmaidens bowed their heads further.

source: 纸条上写着为了保险起见，让他们去鲸岛一个无名的小港口见面，怕他们不知道小港口在哪里，上面还附赠了小港口的地图。
en_us: Written on the paper was a message stating that they should meet at an tiny unknown port on Whale Island to be on the safe side. A map of the port was attached for fear that they did not know where the port was.

source: 纸条上写着游小默记给他的几味轮回丹灵草，至于种子之类的，他并没有限制，只是告诉武成只要是十一二级的灵草都可以。
en_us: You XiaoMo had written a few magic herbs he needed for the Samsara Pill on the slip of paper. He did not note down any restrictions for seeds and so on, only telling Wu Cheng that anything was fine as long as it was a level eleven or twelve magic herb.

source: 细数下来，他和凌霄竟然与赤血家族，妖凰族和麒麟族三大势力的关系都差到极点，一般人与其中一个势力结仇就足够他们喝一壶了。
en_us: After counting, he found that he and Ling Xiao were practically hated by the Demon Phoenix Clan, the ChiXue Clan and the Qilin Clan, three powerful factions. A normal person would probably be trying to drunk off their ass in regret at having bad blood with even one of the three.

source: 终于还是有怨灵忍不住率先出手了。
en_us: Finally, there was a resentful being who couldn't resist anymore and decided to act first.

source: 经脉全毁，就算活下来也会变成废人一个，除非能得到传说中的七品彩丹，不过也要看凌霄给不给他机会当一个废人。
en_us: With his 筋脉 entirely destroyed, even if he did live, he'd live as a crippled person, unless he could obtain the legendary Seventh grade rainbow pill. However, that all depended on if Ling Xiao would give him that chance at all.

source: 经过十几天的巩固，他能感觉得出他的灵魂比以往凝实了许多，固心丹果然是好东西，因为晋级太快，游小默前段时间总觉得灵魂之力的运转有时会凝滞，这样他根本不敢炼丹，一旦失败要赔上一副材料。
en_us: After ten days of consolidation, he could feel that his soul seemed much more durable than before. The Heart Fortification Pill really was great. Because he had advanced too quickly before, You XiaoMo always felt that when he used his soul force, there was a slight friction. He didn't dare to refine pills like that. If he failed, it'd cost a set of materials.

source: 经过小镇门口的时候，游小默听到有人嘀嘀咕咕的说了句‘今年来洞域探险的人怎么比去年还要多’之类的话。
en_us: As they passed by the entrance to one of the towns, You XiaoMo heard some people mumbling about how there were even more people here to explore Dong Yu than last year and other such words.

source: 经过竞价，九成的人已经被三振出局，剩下的都是些小有资本的竞争者，灵酒的价格也从二十万灵晶提升到八百万，整个翻了四十倍。
en_us: After some bidding, ninety percent had given up and all that was left were fairly competent competitions. The price of the spirit wine had also gone from two hundred thousand to eight million, that was fortyfolds.

source: 经过这些天的调查，他已经确定将禁地的囚犯放出的人以及在苍盟绵绵山将风迟云带走的人是同一个，但是没有线索，所以他只知道其中一个小子就是他在找的空间传承者。
en_us: After investigating for these few days, he was certain that the people who had freed the prisoners in the forbidden ground, and the peopl who had taken Feng ChiYun were one and the same, but they didn't have any leads, so he knew that one of them was the inheritor of the pocket dimension he was looking for.

source: 经过黑蜘蛛鉴定，他们只能发现这张羊皮纸上画的地形图是在东洲东南一带，具体位置因为还差三张地图，所以没办法确定，不过南洲东南一带就已经大概能判断出藏宝图可能藏的是什么。
en_us: After an appraisal by the Black Spider, they could only uncover that the map drawn on this parchment was of a region in the southeast of Dong Zhou (东洲东南一带). The exact location could not be determined as they lacked the three other maps, so this could not be confirmed. However, one could roughly determine what the treasure map was possibly hiding based on the region being the southeast of Dong Zhou.

source: 结果——
en_us: However--

source: 结果争论的声音更大了，他们大概没想到会是这么年轻的人，神情更加怀疑了。
en_us: The sounds of doubt rose. They probably didn't expect someone so young, and were even more doubtful.

source: 结果他的话刚说完，天空突然暗了下来。
en_us: But just as he finished, the sky suddenly darkened.

source: 结果凌霄把他们弄出来的时候，皮球和猫球刚好拉着他说话，于是就一并给弄出来了。
en_us: The result was that when Ling Xiao pulled all the demon beasts out, CatQiu and PiQiu were talking to him (and tugged his shirt 拉着他说话), thus he was brought along too.

source: 结果可想而知，游小默的父亲在继承族长之位的前一个月被游震天给陷害了，从此开始逃亡的生涯，顺便带走传族之宝，使得游震天的家主之位一直名不正言不顺。
en_us: The result was as one could well imagine. You XiaoMo's father was framed by You ZhenTian a month before he would inherit the position of the Family Head. Since then, he began a life of a fugitive and conveniently brought along the Inheritance Jewel while on the run, causing You ZhenTian's position as Family Head to remain unverified.

source: 结果让他感到失望，刚回通天大陆没多久就惹出这么多事，果然跟他那个父亲一个样，一样的不讨喜。
en_us: But it made him feel disappointed. He had just returned to TongTian Continent for not very long and he had already caused so much ruckus. Indeed, he was just like his father, not likable at all.

source: 结果证明冲动的是游小默自己。
en_us: In the end, it turned out that the impulsive one was You XiaoMo himself.

source: 结果，谢俊抱着莫雪刚好从他面前经过，看到他，整个人都僵住了，急切地步伐反而停了下来。
en_us: But because of that, Xie Jun, who was carrying Mo Xue, came just in front of him. Seeing him, his whole body froze and his hurried footsteps came to a halt.

source: 结界师白虎亲自布下的，当时白虎的修为还处于巅峰状态，所以尽管结界的存在已经很久了，但三人想要破开结界任然不轻松。
en_us: The wards were personally put up by the White Tiger. At that time the White Tiger's cultivation was still in its peak form. So it was not easy for the three people to break the wards despite them having existed for a long time.

source: 结界被轰得摇晃个不停，宫殿震动的频率也越来越快，毕竟不是连接着地底的。
en_us: The barrier shook, being blasted again and again. The tremors wracking the palace increased in frequency. After all, it wasn't connected to the earth.

source: 绝对是扯淡！
en_us: Absolute nonsense!

source: 绝对绝对不能放过他们。
en_us: His definitely not letting them off the hook.

source: 绵绵山山顶，宴会会场。
en_us: At the banquet on the peak of the continuous mountain.

source: 绵绵山是苍盟的总部，赤血家族不可能大张旗鼓的找人，所以只能让傅苍穹帮忙，不过要瞒住这只老狐狸可得费一番功夫。
en_us: Amaranthine Mountain was the headquarters of the Cang Alliance. The ChiXue Family couldn't mobilize a search team to go around looking for Feng ChiYun, so they could only ask Fu CangWan for help. However, keeping this old fox in the dark might be a very difficult task.

source: 绵绵山的入口仍然有苍盟的守卫看守着，但是能上去的人都是已经验过身份的，所以下去就不用了。
en_us: There were still guards from the Cang Alliance watching over the entrance of the continuous mountain (绵绵山), but there were no checks when going down as the identities of those who could descend the mountain had already been verified.
